/* No comment provided by engineer. */
"%@ (%@) : Connection Notice" = "%1$@ (%2$@) : Yhteyshuomautus";

/* first %@ is an account name; second is a service. This is a title for a window */
"%@ (%@) Setup" = "%1$@ (%2$@) Asetus";

/* No comment provided by engineer. */
"%@ has %u new messages." = "%1$@ on %2$u uutta viestiä.";

/* No comment provided by engineer. */
"%@ has 1 new message." = "%@ on yksi uusi viesti.";

/* No comment provided by engineer. */
"%@ is on your local contact list but not on the server list. Do you want to add this contact to your list?" = "%@ on paikallisessa ystäväluettelossasi, muttei palvelimen luettelossa. Haluatko lisätä ystävän luetteloon?";

/* XMPP service discovery browser gateway tooltip */
"%@; double-click to register." = "%@; rekisteröidy kaksoisnapsautuksella";

/* No comment provided by engineer. */
"(unknown)" = "(tuntematon)";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* No comment provided by engineer. */
"Ad-Hoc command; double-click to execute" = "Ad-Hoc komento; suorita kaksoisnapsautuksella";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Adium : Notice" = "Adium : Huomautus";

/* No comment provided by engineer. */
"Adium can't verify the identity of \"%@\"." = "Adium ei pysty varmentamaan käyttäjän \"%@\" henkilöllisyyttä.";

/* Message shown when a contact's profile can't be found */
"Adium could not find any information in the user's profile. This may not be a registered name." = "Adium ei kyennyt löytämään käyttäjän profiilia. Tämä nimi ei välttämättä ole rekisteröity.";

/* No comment provided by engineer. */
"Adium Notice: %@" = "Adium huomautus: %@";

/* No comment provided by engineer. */
"Adium User" = "Adium käyttäjä";

/* Button title to allow an action */
"Allow" = "Salli";

/* No comment provided by engineer. */
"Allow MSN Mobile pages?" = "Salli MSN Mobile -sivut";

/* Action menu item for MSN accounts to toggle whether Mobile pages [forwarding messages to a mobile device] are enabled */
"Allow/Disallow Mobile Pages" = "Salli/Estä MSN Mobile -sivut";

/* No comment provided by engineer. */
"Always Appear Offline to %@" = "Näytä aina Offline-tilassa olevalta henkilölle: %@";

/* No comment provided by engineer. */
"An error was encoutered sending the file." = "Tiedostoa lähettäessä tapahtui virhe.";

/* No comment provided by engineer. */
"Appear Offline to %@" = "Näytä Offline-tilassa olevalta henkilölle: %@";

/* No comment provided by engineer. */
"Appear Online to %@" = "Näytä Online-tilassa olevalta henkilölle: %@";

/* No comment provided by engineer. */
"Authenticating" = "Varmennetaan";

/* Connection step */
"Balancer handshake" = "Kätellään";

/* No comment provided by engineer. */
"Ban" = "Ban";

/* No comment provided by engineer. */
"Bankick" = "Bankick";

/* No comment provided by engineer. */
"Blocked" = "Estetty";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cancel Presence Notification to %@" = "Peru tilailmoitus käyttäjälle: %@";

/* Category table column header for the service discovery browser */
"Category" = "Kategoria";

/* No comment provided by engineer. */
"Change Currently Registered Email Address" = "Vaihda rekisteröityä sähköpostiosoitetta";

/* Menu item title for changing the password of an account */
"Change Password" = "Vaihda salasana";

/* No comment provided by engineer. */
"Client Version:" = "Asiakasversio:";

/* No comment provided by engineer. */
"Conference service; double-click to join" = "Konferenssipalvelu; liity kaksoinapsautuksella";

/* No comment provided by engineer. */
"Configure IM Forwarding" = "Muokkaa IM-viestien edelleenohjausta";

/* Button title to connect; this is a verb */
"Connect" = "Yhdistä";

/* No comment provided by engineer. */
"Connect using TCP" = "Yhdistä käyttäen TCP:tä";

/* Connection step */
"Connected" = "Yhdistetty";

/* No comment provided by engineer. */
"Connecting" = "Yhdistetään";

/* No comment provided by engineer. */
"Connection error." = "Yhteysvirhe.";

/* No comment provided by engineer. */
"Connection established" = "Yhteys luotu";

/* No comment provided by engineer. */
"Connection:" = "Yhteys:";

/* No comment provided by engineer. */
"Contact list synchronization error for %@" = "Virhe synkronoitaessa ystäväluetteloa tunnuksessa: %@";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete & Unregister" = "Poista ja poista rekisteröinti";

/* No comment provided by engineer. */
"Delete Account" = "Poista tunnus";

/* No comment provided by engineer. */
"Delete Account from Server" = "Poista tunnus palvelimelta";

/* No comment provided by engineer. */
"Delete the account %@? You can also optionally unregister the account on the server if possible." = "Poista tunnus %@? Voit myös vaihtoehtoisesti poistaa rekisteröinnin palvelimelta jos se on mahdollista.";

/* No comment provided by engineer. */
"Deop" = "Deop";

/* No comment provided by engineer. */
"Devoice" = "Devoice";

/* Direct IM is an AIM-specific phrase for transferring images in the message window */
"Direct IM connected" = "Direct IM yhdistetty";

/* Direct IM is an AIM-specific phrase for transferring images in the message window */
"Direct IM disconnected" = "Direct IM yhteys katkaistu";

/* No comment provided by engineer. */
"Directory service; double-click to search" = "Hakemistopalvelu; etsi kaksoisnapsautuksella";

/* Button title to prevent an action */
"Disallow" = "Kiellä";

/* No comment provided by engineer. */
"Discovery Browser" = "Selain";

/* No comment provided by engineer. */
"Display Currently Registered Email Address" = "Näytä nykyinen rekisteröity sähköpostiosoite";

/* No comment provided by engineer. */
"Do you want to allow or disallow people on your buddy list to send you MSN Mobile pages to your cell phone or other mobile device?" = "Haluatko sallia vai estää, että ystäväsi voivat lähettää sinulle MSN Mobile -sivuja puhelimeesi tai muihin mobiililaitteisiisi?";

/* No comment provided by engineer. */
"Don't Always Appear Offline to %@" = "Älä aina näytä Offline-tilassa olevalta henkilölle: %@";

/* Used as a label for a username specified by email address */
"Email" = "Sähköposti";

/* Connection step */
"Exchanging key hash" = "Vaihdetaan hash-avainta";

/* No comment provided by engineer. */
"Export Sametime List..." = "Vie Sametime lista...";

/* Label for the username for a Facebook contact */
"Facebook Email" = "Facebook sähköposti";

/* No comment provided by engineer. */
"Fetching..." = "Haetaan...";

/* No comment provided by engineer. */
"File Send Error" = "Tiedonsiirtovirhe";

/* No comment provided by engineer. */
"Finalizing connection" = "Viimeistellään yhteyttä";

/* No comment provided by engineer. */
"Forcing Login" = "Pakotetaan sisäänkirjautuminen";

/* Generic fields request window title */
"Form" = "Lomake";

/* No comment provided by engineer. */
"From: " = "Lähettäjä: ";

/* No comment provided by engineer. */
"Getting Cookie" = "Haetaan eväste";

/* No comment provided by engineer. */
"GG Number" = "GG numero";

/* No comment provided by engineer. */
"GTalk ID" = "GTalk -tunnus";

/* No comment provided by engineer. */
"Handshake Acknowledged; Sending Login" = "Kättely tunnistettu; Lähetetään kirjautumista";

/* No comment provided by engineer. */
"Handshaking" = "Kättelee";

/* No comment provided by engineer. */
"ICQ Number" = "ICQ numero";

/* No comment provided by engineer. */
"Import Sametime List..." = "Tuo Sametime lista...";

/* Error message displayed when the server reports username or password as being incorrect. */
"Incorrect username or password" = "Väärä käyttäjätunnus tai salasana";

/* No comment provided by engineer. */
"Info" = "Tietoja";

/* No comment provided by engineer. */
"Initializing Stream" = "Alustetaan streamiä";

/* No comment provided by engineer. */
"Initiate Conference with %@" = "Aloita konferenssi käyttäjän %@ kanssa";

/* No comment provided by engineer. */
"Initiate Direct IM with %@" = "Aloita Direct IM käyttäjän %@ kanssa";

/* No comment provided by engineer. */
"Initiate Multiuser Chat with %@" = "Aloita monen käyttäjän keskustelu %@ kanssa";

/* No comment provided by engineer. */
"Invite" = "Kutsu";

/* No comment provided by engineer. */
"IRC (Internet Relay Chat)" = "IRC (Internet Relay Chat)";

/* No comment provided by engineer. */
"Jabber ID" = "Jabber -tunnus";

/* JID (Jabber ID) table column header for the service discovery browser. This may not need to be localized. */
"JID" = "JID";

/* No comment provided by engineer. */
"Join" = "Liity";

/* No comment provided by engineer. */
"Join %@'s Chat" = "Liityä käyttäjän %@ keskusteluun";

/* No comment provided by engineer. */
"Kick" = "Kick";

/* No comment provided by engineer. */
"Launch %@" = "Käynnistä %@";

/* No comment provided by engineer. */
"LiveJournal ID" = "LiveJournal -tunnus";

/* Connection step */
"Logging in" = "Kirjaudutaan sisään";

/* No comment provided by engineer. */
"Login Acknowledged" = "Kirjautuminen tunnistettu";

/* No comment provided by engineer. */
"Login Redirected" = "Kirjautuminen uudelleenohjattu";

/* No comment provided by engineer. */
"Looking up server" = "Etsitään palvelinta";

/* No comment provided by engineer. */
"Member Name" = "Jäsennimi";

/* Menu title for configuring the public information for a QQ account */
"Modify My Information" = "Muuta tietojani";

/* user mood tooltip title */
"Mood" = "Mieliala";

/* No comment provided by engineer. */
"MSN Passport" = "MSN Passport";

/* Label for the username for a MySpace contact */
"MySpace ID" = "MySpace -tunnus";

/* Name table column header for the service discovery browser */
"Name" = "Nimi";

/* No comment provided by engineer. */
"New Mail" = "Uusi sähköposti";

/* Sample name and server for new IRC accounts */
"nickname" = "lempinimi";

/* Name for IRC user names */
"Nickname" = "Lempinimi";

/* No comment provided by engineer. */
"No reason was given." = "Ei syytä.";

/* No comment provided by engineer. */
"No server has been configured for the %@ account %@. Please enter one below to connect" = "Palvelinta ei ole asetettu %1$@ tunnukselle %2$@. Ole hyvä ja anna palvelin alla yhdistääksesi siihen";

/* No comment provided by engineer. */
"No Server Specified" = "Palvelinta ei ole määritetty";

/* No comment provided by engineer. */
"Node:" = "Palvelin:";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Op" = "Op";

/* No comment provided by engineer. */
"Open Mail in Browser" = "Avaa sähköposti selaimessa";

/* Name for the orphans group */
"Orphans" = "Orvot";

/* No comment provided by engineer. */
"Parse Error." = "Jäsennysvirhe.";

/* No comment provided by engineer. */
"Password sent" = "Salasana lähetetty";

/* No comment provided by engineer. */
"Ping %@" = "Ping %@";

/* No comment provided by engineer. */
"Presence Settings for %@" = "Tila-asetukset henkilölle: %@";

/* No comment provided by engineer. */
"Re-request Authorization from %@" = "Lähetä pyyntö uudelleen henkilölle: %@";

/* Description of a step in the connection process for MySpace. This could be translated as something like 'Reading from server'. */
"Reading challenge" = "Luetaan palvelimelta";

/* Connection step */
"Reading data" = "Luetaan dataa";

/* Connection step */
"Reading server key" = "Luetaan palvelimen avainta";

/* No comment provided by engineer. */
"Really remove gateway?" = "Poista yhdyskäytävä?";

/* No comment provided by engineer. */
"Received authorization" = "Lupa myönnetty";

/* alert default button */
"Remove" = "Poista";

/* gateway menu item */
"Remove gateway" = "Poista yhdyskäytävä";

/* No comment provided by engineer. */
"Retrieving buddy list" = "Haetaan ystäväluetteloa";

/* Roster - the Jabber default group */
"Roster" = "Lista";

/* No comment provided by engineer. */
"Screen Name" = "Näyttönimi";

/* No comment provided by engineer. */
"Screen name sent" = "Näyttönimi lähetetty";

/* No comment provided by engineer. */
"Search for Contact By Email Address" = "Etsi ystävä sähköpostiosoitteella";

/* No comment provided by engineer. */
"Search for Users" = "Etsi käyttäjiä";

/* No comment provided by engineer. */
"Search Results" = "Etsinnäntulokset";

/* No comment provided by engineer. */
"Send" = "Lähetä";

/* No comment provided by engineer. */
"Send Message" = "Lähetä viesti";

/* No comment provided by engineer. */
"Send to %@'s Mobile" = "Lähetä tekstiviestillä henkilölle: %@";

/* No comment provided by engineer. */
"Sending Cookie" = "Lähetetään evästettä";

/* No comment provided by engineer. */
"Sending Handshake" = "Kätellään";

/* Window title for the service discovery browser */
"Service Discovery Browser" = "Selain";

/* No comment provided by engineer. */
"Service:" = "Palvelu:";

/* No comment provided by engineer. */
"Set Home Phone Number" = "Aseta kotipuhelin";

/* No comment provided by engineer. */
"Set Mobile Phone Number" = "Aseta matkapuhelin";

/* No comment provided by engineer. */
"Set Mood" = "Aseta mieliala";

/* No comment provided by engineer. */
"Set Nickname" = "Aseta lempinimi";

/* No comment provided by engineer. */
"Set Privacy Options" = "Muuta yksityisyyden asetuksia";

/* No comment provided by engineer. */
"Set User Info" = "Muuta käyttäjätietoja";

/* No comment provided by engineer. */
"Set Work Phone Number" = "Aseta työpuhelin";

/* Title for the MSN display name setting dialogue box */
"Set your friendly name." = "Aseta viestinimi";

/* Title for the dialogue prompting for your home phone number */
"Set your home phone number." = "Aseta oma kotipuhelin";

/* Title for the dialogue prompting for your mobile phone number */
"Set your mobile phone number." = "Aseta oma matkapuhelin";

/* Title for the dialogue prompting for your work phone number */
"Set your work phone number." = "Aseta oma työpuhelin";

/* Account action menu item to show a list of contacts for whom this account is awaiting authorization to be able to show them in the contact list */
"Show Contacts Awaiting Authorization" = "Näytä hyväksymistä odottavat ystävät";

/* No comment provided by engineer. */
"Show Server Certificate" = "Näytä palvelimen sertifikaatti";

/* No comment provided by engineer. */
"Starting authentication" = "Aloitetaan autentikointi";

/* No comment provided by engineer. */
"Starting Services" = "Aloitetaan palvelut";

/* No comment provided by engineer. */
"Subject: " = "Aihe:";

/* No comment provided by engineer. */
"Temporarily Hide From %@" = "Piiloudu väliaikaisesti henkilöltä: %@";

/* No comment provided by engineer. */
"The certificate of the server %@ is not trusted, which means that the server's identity cannot be automatically verified. Do you want to continue connecting?\n\nFor more information, click \"Show Certificate\"." = "Palvelimen %@ sertifikaattiin ei luoteta. Tämä tarkoittaa sitä, että palvelimen identiteettiä ei pystytä varmistamaan automaattisesti. Haluatko jatkaa yhdistämistä?\n\nJos haluat lisää tietoa, napsauta \"Näytä sertifikaatti\".";

/* No comment provided by engineer. */
"The name you entered is not registered. Check to ensure you typed it correctly." = "Nimeä jonka annoit ei ole rekisteröity. Tarkista, että kirjoitit sen oikein.";

/* No comment provided by engineer. */
"The other user is in your deny list." = "Toinen käyttäjä on kieltolistallasi.";

/* No comment provided by engineer. */
"The other user is temporarily unavailable." = "Toinen käyttäjä ei ole tällä hetkellä tavoitettavissa.";

/* Invalid name on AIM */
"The screen name you entered is not registered. Check to ensure you typed it correctly. If it is a new name, you must register it at www.aim.com before you can use it." = "Antamasi viestinimi ei ole käytössä. Varmista, että olet kirjoittanut sen oikein. Jos sinulla ei vielä ole AIM-viestinimeä, sinun tulee rekisteröidä se osoitteessa www.aim.com.";

/* Be careful to keep the % parts the same in this string. %@ will be replaced by an error message. */
"The Zephyr Host Manager reported an error #%d: %@" = "Zephyr Host Manager antoi virheen #%1$d: %2$@";

/* Description for the MSN display name setting dialogue. */
"This is the name that other MSN buddies will see you as." = "MSN ystäväsi näkevät sinut tällä nimellä.";

/* No comment provided by engineer. */
"This node does not provide any services accessible to this program." = "Tämä palvelin ei tarjoa mitään palveluja joita voitaisiin käyttää tästä ohjelmasta.";

/* No comment provided by engineer. */
"This node provides ad-hoc commands. Open the context menu to access them." = "Tämä palvelin tarjoaa ad-hoc komentoja. Avaa konteksti valikko käyttääksesi niitä.";

/* No comment provided by engineer. */
"This operation would remove the gateway %@ itself and all contacts belonging to the gateway on your contact list. It cannot be undone." = "Tämä operaatio poistaisi yhdyskäytävän %@ ja kaikki siihen kuuluvat tunnukset ystäväluettelostasi. Tätä ei voi kumota.";

/* No comment provided by engineer. */
"Transferring" = "Siirretään";

/* user tune tooltip title */
"Tune" = "Virittäydy";

/* No comment provided by engineer. */
"Un-hide From %@" = "Näyttäydy käyttäjälle: %@";

/* No comment provided by engineer. */
"Unable to parse the server list at %@. Please try again later." = "Palvelinluetteloa %@ ei pystytä jäsentämään. Yritä uudelleen myöhemmin.";

/* No comment provided by engineer. */
"United States" = "Yhdysvallat";

/* No comment provided by engineer. */
"Unsubscribe %@" = "Poista tilaus %@";

/* Sample name and server for new livejournal accounts */
"username" = "käyttäjänimi";

/* Sample name and server for new gmail accounts */
"username@gmail.com" = "käyttäjänimi@gmail.com";

/* Sample name and server for new Jabber accounts */
"username@jabber.org" = "käyttäjänimi@jabber.org";

/* No comment provided by engineer. */
"Verify Certificate" = "Varmenna sertifikaatti";

/* No comment provided by engineer. */
"View %@'s %@ web profile" = "Katso käyttäjän %1$@ %2$@ nettiprofiili";

/* No comment provided by engineer. */
"View %@'s Facebook profile" = "Katso käyttäjän %@ Facebook profiili";

/* No comment provided by engineer. */
"View %@'s Webcam" = "Näytä käyttäjän %@ nettikamera";

/* No comment provided by engineer. */
"Voice" = "Ääni";

/* No comment provided by engineer. */
"Waiting for Handshake Acknowledgement" = "Odotetaan kättelyn tunnistamista";

/* No comment provided by engineer. */
"Waiting for Login Acknowledgement" = "Odotetaan kirjautumisen tunnistamista";

/* No comment provided by engineer. */
"Waiting for Response" = "Odotetaan vastausta";

/* No comment provided by engineer. */
"Warning level is too high." = "Varoitustaso on liian korkea.";

/* No comment provided by engineer. */
"WARNING! This will delete the account %@ from the Jabber server, and can not be undone.\nAre you sure you want to proceed?" = "VAROITUS! Tämä poistaa tunnuksen %@ Jabber palvelimelta, eikä tätä voida perua.\nOletko varma, että haluat jatkaa?";

/* No comment provided by engineer. */
"XML Console" = "XML konsoli";

/* No comment provided by engineer. */
"Yahoo! ID" = "Yahoo! -tunnus";

/* No comment provided by engineer. */
"You are sending messages too quickly; wait a moment and try again." = "Lähetät viestejä liian tiheään tahtiin. Odota hetki ja yritä uudelleen.";

/* No comment provided by engineer. */
"You have %u new messages." = "Sinulla on %u uutta viestiä.";

/* No comment provided by engineer. */
"You have 1 new message." = "Sinulla on 1 uusi viesti.";

/* No comment provided by engineer. */
"You have mail!\n" = "Sinulle on sähköpostia!\n";

/* No comment provided by engineer. */
"Your message to %@ did not get sent" = "Sinun viestiäsi käyttäjälle %@ ei pystytty lähettämään";

/* No comment provided by engineer. */
"Your message was refused by the other user." = "Vastaanottaja ei ottanut viestiäsi vastaan.";

/* No comment provided by engineer. */
"Your message was too big." = "Viestisi oli liian pitkä.";

/* zhm is the Zephyr Host Manager and should not be a localized word */
"zhm Failure" = "zhm vika";